[
  {
    "title": "OneClick",
    "slug": "OneClick",
    "date": "2025-03-26T00:00:00.000Z",
    "image": "images/One-Click-Black.png",
    "technologies": [
      "React",
      "FastApi",
      "Go",
      "MariaDb"
    ],
    "github": "https://github.com/username/projet-1",
    "demo": "https://demo-projet-1.com",
    "featured": true,
    "order": 1,
    "content": "<h2>Description</h2>\n<p><strong>Projet de Fin d&#39;Études</strong> — OneClick est une plateforme innovante permettant de simplifier et d’automatiser l’initialisation de projets web. Grâce à une interface intuitive, OneClick génère les environnements de développement complets (frontend, backend, base de données) en quelques clics, en prenant en compte les technologies choisies par l’utilisateur.</p>\n<h2>Fonctionnalités</h2>\n<ul>\n<li>Sélection de stacks technologiques (React, Angular, NestJS, Node.js, FastAPI, etc.)</li>\n<li>Génération automatique de projets avec les dépendances adéquates</li>\n<li>Création de Dockerfiles compatibles avec les technologies sélectionnées</li>\n<li>Mode mono-repo ou multi-repo selon les préférences du développeur</li>\n<li>Interface utilisateur claire pour la configuration des projets</li>\n<li>Intégration d’une base de données MariaDB avec configuration automatique</li>\n<li>Scripts Go pour la gestion et le déploiement des projets</li>\n</ul>\n<h2>Défis et Solutions</h2>\n<p><strong>Défi :</strong> Gérer la compatibilité entre plusieurs combinaisons de technologies frontend et backend.<br><strong>Solution :</strong> Mise en place d’un système modulaire basé sur des templates pour chaque stack, combinés dynamiquement selon le choix de l’utilisateur.</p>\n<p><strong>Défi :</strong> Offrir une flexibilité entre mono-repo et multi-repo.<br><strong>Solution :</strong> Conception d’un générateur adaptatif capable de structurer les projets selon le mode sélectionné, avec une logique de routing conditionnelle.</p>\n<p><strong>Défi :</strong> Faciliter l’intégration de Docker dès la création du projet.<br><strong>Solution :</strong> Génération automatique de fichiers Docker et Docker Compose, adaptés à la stack choisie, permettant une exécution rapide en environnement isolé.</p>\n<p><strong>Défi :</strong> Créer une interface simple pour des utilisateurs non techniques.<br><strong>Solution :</strong> Développement d’une interface React claire et ergonomique, guidant pas à pas la création du projet.</p>\n<h2>Objectifs</h2>\n<ul>\n<li>Réduire le temps d’initialisation des projets</li>\n<li>Uniformiser les environnements de développement</li>\n<li>Faciliter le travail en équipe grâce à des structures standardisées</li>\n<li>Rendre l’initialisation accessible à tous profils (techniques ou non)</li>\n</ul>\n<h2>Résultat</h2>\n<p>OneClick permet de créer en quelques instants un environnement de développement complet, prêt à être utilisé, avec une structure propre et modulaire. Le projet a été pensé pour évoluer vers un produit réel destiné aux freelances, agences et étudiants.</p>\n",
    "id": "oneclick"
  }
]